# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 4 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [32, 3, 2]],  # 0-P1/2
    [-1, 1, MobileNetV2, [16, 1, 1]],  # 1
    [-1, 1, MobileNetV2, [24, 2, 2]],  # 2
    [-1, 1, MobileNetV2, [32, 3, 2]],  # 3
    [-1, 1, MobileNetV2, [64, 4, 2]],  # 4
    [-1, 1, MobileNetV2, [96, 3, 1]],  # 5
    [-1, 1, MobileNetV2, [160, 3, 2]], # 6
    [-1, 1, MobileNetV2, [320, 1, 1]], # 7
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 3, BottleneckCSP, [512, False]],  # 14
    [-1, 1, Conv, [1024, 1, 1]],  # 15
    [-1, 1, Detect, [nc, anchors]],  # Detect(predict)
  ]
